{
  "id": "LazyCowboy.RegionRandomizer",
  "name": "Region Randomizer 1.2",
  "version": "1.2.1",
  "authors": "LazyCowboy",
  "description": "Randomizes the connections between regions, redirecting karma gates to load different regions. Now features better region placement logic and far greater stability!<LINE><LINE>UPDATE 1.2 (Huge update!):<LINE>* Regions are now arranged by default in such a way that navigating the world has some sense. Try to make a map as you go along of where each region is!<LINE>* Karma gates no longer forcibly teleport all creatures outside of the gate upon passing through them. Instead, gates should be passable in a fairly normal fashion.<LINE>    -NOTE: Some gates have hidden connections. Use dev tools (O + M) or the map if you cannot find the exit.<LINE>* Significant stability and performance improvements. While you might not directly notice all of them, the overall effect should be quite noticeable.<LINE>* Added the option to keep karma gate requirements unchanged.<LINE>* Added support for custom regions with 3-letter acronyms.<LINE><LINE>I made this mod because I have a problematic playstyle: I rush straight to the nearest functioning iterator and then bee-line towards the Depths. I wanted to explore community-made regions, but most of them are out of the way of normal campaigns. Therefore, I wrote a mod to scramble regions around so I would have to wander around dozens of regions searching for an iterator.<LINE>This mod makes you go on a hunt for echoes in order to gain 10 (X) karma (or as much karma as is possible) in order to go to an iterator and receive the Mark of communication, which is required to access Subterranean. You may even find yourself exploring Metropolis as Rivulet, or passing through the Exterior and the Rot as Saint!<LINE><LINE>Settings explanation:<LINE>* Gate Karma Penalty: Subtracts from the player's karma when passing through gates, as an extra challenge. I added this because it was too easy to sprint from one region to the next, spending little time in each region.<LINE>* Karma Per Echo: Recommended to be kept at -1, so that it is automatically generated.<LINE>* Random Karma Leniency: Makes some karma requirements randomly more lenient.<LINE>* Regions tab: This enables settings for each region, specifically the ability to make the randomizer ignore a region or to make it forbid entry into that region entirely.<LINE>The other settings should not be touched, since most are either dysfunctional or potentially game-breaking.<LINE><LINE>KNOWN ISSUES:<LINE>* Upon first starting a campaign/expedition, the gate karma requirements will likely not yet be updated. Use a shelter at least once before passing through any gate.<LINE>* Having the map open while passing through the gate can create bugs. Just don't open it while using a gate.<LINE>* The game occasionally freezes upon using the first karma gate. Reload the game and try again.<LINE>* Custom slugcat campaigns are mostly untested; use at your own risk.<LINE>* Monk can unlock gates that were never supposed to be unlocked. This is unfortunately unavoidable. Just don't use Monk, coward.<LINE>* Some custom regions may not work well with the randomizer. If you experience issues with any gates, try using devtools to see the name of the gate before and after you activate it. This will help me troubleshoot.<LINE>* Several gates have their karma symbols flipped, causing some regions to be erroneously (in)accessable. There is little I can do about the incompetence of other mod authors.",
  "requirements": ["regionkit"],
  "requirements_names": ["Region Kit"],
  "tags": ["Regions", "Game Modes"],
  "checksum_override_version": false
}
